### Objectives
In this lab you will:

Create lambda functions to use as arguments of other functions
Use the .map() or .apply() method to apply a function to a pandas series or DataFrame

In [78]:
import pandas as pd
df = pd.read_csv('data/Yelp_Reviews.csv', index_col=0)
df.head(2)

,business_id,cool,date,funny,review_id,stars,text,useful,user_id
1,pomGBqfbxcqPv14c3XH-ZQ,0,2012-11-13,0,dDl8zu1vWPdKGihJrwQbpw,5,I love this place! My fiance And I go here atl...,0,msQe1u7Z_XuqjGoqhB0J5g
2,jtQARsP6P-LbkyjbO1qNGg,1,2014-10-23,1,LZp4UX5zK3e-c5ZGSeo3kA,1,Terrible. Dry corn bread. Rib tips were all fa...,3,msQe1u7Z_XuqjGoqhB0J5g

### Simple arithmetic
Use a lambda function to create a new column called 'stars_squared' by squaring the stars column.

In [79]:
# example = df['stars'].iloc[0]
# example **2
df['stars_squared'] = df['stars'].map(lambda x: x**2)
df.head(2)

,business_id,cool,date,funny,review_id,stars,text,useful,user_id,stars_squared
1,pomGBqfbxcqPv14c3XH-ZQ,0,2012-11-13,0,dDl8zu1vWPdKGihJrwQbpw,5,I love this place! My fiance And I go here atl...,0,msQe1u7Z_XuqjGoqhB0J5g,25
2,jtQARsP6P-LbkyjbO1qNGg,1,2014-10-23,1,LZp4UX5zK3e-c5ZGSeo3kA,1,Terrible. Dry corn bread. Rib tips were all fa...,3,msQe1u7Z_XuqjGoqhB0J5g,1

### Dates
Select the month from the date string using a lambda function.

In [80]:
print(df['date'].dtype)
df['date'].head()

object

1     2012-11-13
2     2014-10-23
4     2014-09-05
5     2011-02-25
10    2016-06-15
Name: date, dtype: object

In [81]:
df['date'] = pd.to_datetime(df['date'],format='%Y-%m-%d')

In [82]:
df['date'].head()

1    2012-11-13
2    2014-10-23
4    2014-09-05
5    2011-02-25
10   2016-06-15
Name: date, dtype: datetime64[ns]

In [83]:
# example = df['date'].iloc[0]
# example.year
df['date'].map(lambda x: x.month)

1       11
2       10
4        9
5        2
10       6
        ..
689      6
4874     8
564      6
3458    10
4206     8
Name: date, Length: 2610, dtype: int64

In [ ]:
#teachers code
#df['date'].map(lambda x: x[5:7]).head()

### What is the average number of words for a yelp review?
Do this with a single line of code.

In [84]:
import numpy as np
# example = df['text'].iloc[0]
# len(example.split())
np.mean(list(df['text'].map(lambda x: len(x.split()))))

77.06551724137931

In [92]:
#teacher code
df['text'].map(lambda x: len(x.split())).mean()

77.06551724137931

### Create a new column for the number of words in the review

In [85]:
df['no_of_words'] = df['text'].map(lambda x: len(x.split()))
df.head()

,business_id,cool,date,funny,review_id,stars,text,useful,user_id,stars_squared,no_of_words
1,pomGBqfbxcqPv14c3XH-ZQ,0,2012-11-13,0,dDl8zu1vWPdKGihJrwQbpw,5,I love this place! My fiance And I go here atl...,0,msQe1u7Z_XuqjGoqhB0J5g,25,58
2,jtQARsP6P-LbkyjbO1qNGg,1,2014-10-23,1,LZp4UX5zK3e-c5ZGSeo3kA,1,Terrible. Dry corn bread. Rib tips were all fa...,3,msQe1u7Z_XuqjGoqhB0J5g,1,30
4,Ums3gaP2qM3W1XcA5r6SsQ,0,2014-09-05,0,jsDu6QEJHbwP2Blom1PLCA,5,Delicious healthy food. The steak is amazing. ...,0,msQe1u7Z_XuqjGoqhB0J5g,25,30
5,vgfcTvK81oD4r50NMjU2Ag,0,2011-02-25,0,pfavA0hr3nyqO61oupj-lA,1,This place sucks. The customer service is horr...,2,msQe1u7Z_XuqjGoqhB0J5g,1,82
10,yFumR3CWzpfvTH2FCthvVw,0,2016-06-15,0,STiFMww2z31siPY7BWNC2g,5,I have been an Emerald Club member for a numbe...,0,TlvV-xJhmh7LCwJYXkV-cg,25,32

### Rewrite the following as a lambda function
Create a new column 'Review_Length' by applying this lambda function to the 'Review_num_words' column.

In [93]:
# example = df['no_of_words'].iloc[0]
# example
df['Review_length'] = df['no_of_words'].map(lambda x:  'short' if x<50 else ('medium' if x<80 else 'Long'))
df[['no_of_words','Review_length']]

      no_of_words Review_length
1              58        medium
2              30         short
4              30         short
5              82          Long
10             32         short
...           ...           ...
689            61        medium
4874           43         short
564            79        medium
3458          185          Long
4206           42         short

[2610 rows x 2 columns]

### Level Up: Dates Advanced
Overwrite the 'date' column by reordering the month and day from YYYY-MM-DD to DD-MM-YYYY. Try to do this using a lambda function.

In [87]:
#Print the first five rows of the 'date' column.
df['date'].head()

1    2012-11-13
2    2014-10-23
4    2014-09-05
5    2011-02-25
10   2016-06-15
Name: date, dtype: datetime64[ns]

In [88]:
example = df['date'].iloc[0]
example.strftime('%d-%m-%Y')

'13-11-2012'

In [89]:
df['date2'] = df['date'].map(lambda x : x.strftime('%d-%m-%Y'))
df[['date','date2']]

           date       date2
1    2012-11-13  13-11-2012
2    2014-10-23  23-10-2014
4    2014-09-05  05-09-2014
5    2011-02-25  25-02-2011
10   2016-06-15  15-06-2016
...         ...         ...
689  2013-06-02  02-06-2013
4874 2016-08-14  14-08-2016
564  2016-06-14  14-06-2016
3458 2013-10-02  02-10-2013
4206 2016-08-15  15-08-2016

[2610 rows x 2 columns]

In [103]:
#Teachers code
df['date'].map(lambda x : '{}-{}-{}'.format(x[-2:],x[5:7],x[:4])) #if column not yet converte to date